{
    "sandbox": {
        "dialog": "Bienvenue dans le mode sandbox !\n Ici, tu peux experimenter librement sur une image de ton choix et sauvegarder le resultat !"
    },
    "0": {
        "dialog": "Welcome to PixOp!\nIn this tutorial, you will learn how to use image processing operations.\nConnect nodes from the start to the final node to transform the image, you can use the toolbox on the left to get new nodes.\nTry to match the target image on the right!",
        "psnr_start": 61.54,
        "psnr_goal": 200.0
    },
    "1": {
        "dialog": "Great job on the first level!\nThis time, you will learn about erosion, a morphological operation.\nErosion shrinks dark regions and expands bright regions in an image.\nIt's useful to remove noise, separate connected objects, or thin out features.\nTry using an erosion to match the target!",
        "psnr_start": 0.0,
        "psnr_goal": 92.4970233580119
    },
    "2": {
        "dialog": "Excellent! Now let's learn about dilation.\nDilation is the opposite of erosion: it expands dark regions and shrinks bright regions.\nThis operation uses a kernel and takes the maximum pixel value.\nIt's useful to fill small holes, connect nearby objects, or enhance features.\nDilation and erosion are often combined for advanced image processing.\nTry using dilation to match the target!",
        "psnr_start": 0.0,
        "psnr_goal": 102.039448452405
    },
    "3": {
        "dialog": "Great progress! Now let's explore dynamic range expansion.\nThe goal is to reveal details hidden in a nearly monochrome image.\nDynamic range expansion stretches pixel values to use the full intensity range (0-255).\nThis technique enhances contrast and makes subtle differences visible.\nStart with a dark image and expand its range to reveal the hidden content.\nTransform the image to match the target!",
        "psnr_start": 0.0,
        "psnr_goal": 65.1468913031136
    },
    "4": {
        "dialog": "Time for a challenge! Try to blur only the background of the image.\nTo do this, you'll need a truth map (mask) that tells which areas to blur and which to keep sharp.\nYou should know by now how to binarize an image to create such a mask.\nCombine what you've learned: thresholding, morphological operations, and blur.\nGood luck!",
        "psnr_start": 0.0,
        "psnr_goal": 200.0
    },
    "5": {
        "dialog": "Dans ce niveau, vous allez apprendre le format YCrCb et pourquoi on l'utilise.\nY représente la luminosité / l'intensité de l'image — c'est là que se trouvent les détails et le contraste.\nCr (chrominance rouge) et Cb (chrominance bleue) représentent l'information de couleur : ce sont des différences de couleur par rapport à la luminance.\nEn convertissant RGB → YCrCb, vous pouvez traiter la luminance et la chrominance séparément : par exemple, appliquer un flou ou une expansion dynamique sur Y sans altérer les couleurs, ou filtrer le bruit sur Cr/Cb sans toucher aux détails lumineux.\nLe but ici est d'obtenir une seule image de sortie : convertissez en YCrCb, appliquez vos opérations sur les canaux choisis (Y ou Cr/Cb), puis reconvertissez en RGB (YCrCb → RGB) pour produire l'image finale.\nIndice : pour obtenir l'image finale, essayez d'inverser un des canaux avant la reconversion en RGB\nEssayez de combiner ces étapes pour obtenir l'image cible !",
        "psnr_start": 0.0,
        "psnr_goal": 200.0
    }
}